Godcomplexx/Keychain_motion/xiao_nrf52840/src/main.c
static void apply_state_entry_actions(motion_state_t state,
                                      int64_t now_us,
                                      int64_t *previous_frame_us,
                                      int64_t *previous_sleep_frame_us,
                                      int64_t *previous_time_frame_us)
{
    /* A missing OLED is not fatal: BLE and sensor probing keep running. */
    if (!oled_display_is_available()) {
        ESP_LOGI(TAG, "Entered %s state (OLED absent)",
                 motion_state_name(state));
        return;
    }

    (void)oled_display_set_power(true);
    switch (state) {
    case MOTION_STATE_FLUID:
        (void)oled_display_set_contrast(OLED_ACTIVE_CONTRAST);
        flip_animation_reset();
        *previous_frame_us = now_us;
        break;
    case MOTION_STATE_SLEEP:
        (void)oled_display_set_contrast(OLED_IDLE_CONTRAST);
        *previous_sleep_frame_us = 0;
        break;
    case MOTION_STATE_TIME:
        (void)oled_display_set_contrast(OLED_ACTIVE_CONTRAST);
        *previous_time_frame_us = 0;
        break;
    case MOTION_STATE_GAME:
        (void)oled_display_set_contrast(OLED_GAME_CONTRAST);
        *previous_frame_us = now_us;
        break;
    default:
        break;
    }
    ESP_LOGI(TAG, "Entered %s state", motion_state_name(state));
}

static motion_event_t detector_result_to_event(
    const motion_detector_result_t *result)
{
    if (result->shake_detected) return MOTION_EVENT_SHAKE_DETECTED;
    if (result->movement_detected) return MOTION_EVENT_MOVEMENT_DETECTED;
    if (result->stillness_timeout) return MOTION_EVENT_STILLNESS_TIMEOUT;
    return MOTION_EVENT_NONE;
}

static void log_render_error(const char *screen, esp_err_t err)
{
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "%s render deferred; OLED will be reprobed: %s",
                 screen, esp_err_to_name(err));
    }
}

int main(void)
{
    /* USB is useful on XIAO but optional on the battery-powered final PCB. */
    (void)usb_enable(NULL);
    ESP_LOGI(TAG, "Smart Motion Keychain nRF52840 port started");
    /*
     * Three images exist for two boards. Saying which one is running turns a
     * confusing log into an obvious one - especially "why does USB update not
     * work", whose answer is usually that this is the bare image.
     */
#if defined(CONFIG_BOOTLOADER_MCUBOOT)
    ESP_LOGI(TAG, "Build: MCUboot slot0 image; USB update available");
#else
    ESP_LOGI(TAG, "Build: bare image at flash origin; SWD update only");
#endif

    flip_animation_stats_t flip_stats;
    if (flip_animation_prepare(&flip_stats) != ESP_OK) {
        ESP_LOGE(TAG, "FLIP model preparation failed");
        return 0;
    }

    int64_t now_us = uptime_us();
    int64_t previous_frame_us = now_us;
    int64_t previous_sleep_frame_us = 0;
    int64_t previous_time_frame_us = 0;
    int64_t last_sensor_probe_us = now_us - HARDWARE_RETRY_INTERVAL_US;
    int64_t last_display_probe_us = now_us - HARDWARE_RETRY_INTERVAL_US;
    int64_t last_sensorless_ble_request_us =
        now_us - SENSORLESS_BLE_RETRY_US;
    uint32_t frames_until_log = 0;
    int demo_direction = 1;
    float demo_tilt = -0.7f;
    float last_tilt_x = 0.0f;
    int previous_tilt_zone = 0;
    bool previous_charger_attached = false;
    bool sensorless_ble_announced = false;
    int64_t last_battery_sample_us = 0;
    uint8_t battery_percent = BATTERY_PERCENT_UNKNOWN;
    uint8_t last_logged_percent = BATTERY_PERCENT_UNKNOWN;
    int32_t battery_millivolts = 0;
    pet_behavior_id_t previous_pet_id = PET_ID_COUNT;

    device_clock_t clock;
    device_clock_init(&clock, now_us);
    device_clock_datetime_t datetime;
    device_clock_get_datetime(&clock, now_us, &datetime);
    step_counter_t steps;
    step_counter_init(&steps, device_clock_date_key(&datetime));
    motion_detector_t detector;
    motion_detector_init(&detector, now_us,
                         MOTION_MOVEMENT_DELTA_THRESHOLD,
                         MOTION_SHAKE_DELTA_THRESHOLD,
                         MOTION_SHAKE_COUNT_REQUIRED,
                         MOTION_SHAKE_WINDOW_US,
                         SLEEP_STILLNESS_TIMEOUT_US);
    motion_state_machine_t state_machine;
    motion_state_init(&state_machine, now_us);
    breakout_game_t game;

    /* The companion behaviour engine keeps its own clock in milliseconds. */
    pet_behavior_t pet;
    pet_behavior_init(&pet, (uint32_t)(now_us / 1000), sys_rand32_get());
    pet_face_reset(sys_rand32_get());

    if (oled_display_init() == ESP_OK) {
        (void)oled_display_set_contrast(OLED_ACTIVE_CONTRAST);
        (void)oled_display_show_startup();
        k_sleep(K_MSEC(STARTUP_SCREEN_DELAY_MS));
        flip_animation_reset();
    } else {
        ESP_LOGW(TAG, "OLED absent; the application stays alive");
    }
    last_display_probe_us = uptime_us();

    if (mpu6050_init() != ESP_OK) {
        ESP_LOGW(TAG,
                 "Accelerometer absent; display uses demo motion and BLE stays visible");
    }
    last_sensor_probe_us = uptime_us();

    accel_int_init();
    (void)battery_init();

    /* Both drivers have reported by now; this says what is really on the bus,
     * which is the difference between a loose wire and a driver problem. */
    i2c_scan_log();

    const bool phone_sync_available = phone_sync_init() == ESP_OK;
    if (!phone_sync_available) {
        ESP_LOGW(TAG, "Phone synchronization is unavailable");
    }
    bool phone_sync_window_active = false;
    int64_t phone_sync_window_deadline_us = 0;

#if defined(CONFIG_BOOTLOADER_MCUBOOT)
    /*
     * A no-op with the current update path: serial recovery writes slot0 in
     * place, so the image already counts as confirmed on its first boot. It is
     * kept because uploading to the secondary slot instead would make the image
     * a test image, and then reaching this line - display up, sensor probed,
     * BLE running - is exactly the evidence worth confirming on.
     */
    if (!boot_is_img_confirmed()) {
        if (boot_write_img_confirmed() == 0) {
            ESP_LOGI(TAG, "Image confirmed; MCUboot will keep it");
        } else {
            ESP_LOGE(TAG, "Could not confirm image; MCUboot will revert it");
        }
    }
#endif

    previous_charger_attached = charger_is_attached();
    pet_behavior_post(&pet, PET_EVENT_BOOT_COMPLETED,
                      (uint32_t)(uptime_us() / 1000));

    previous_frame_us = uptime_us();
    while (true) {
        /* Preserve convenient USB reflashing after the SoC is moved. */
        usb_dfu_touch_poll();
        now_us = uptime_us();
        float frame_seconds =
            (float)(now_us - previous_frame_us) / MICROSECONDS_PER_SECOND;
        /* Do not inject a huge physics step after USB/BLE delays. */
        if (frame_seconds < 0.001f || frame_seconds > 0.1f) {
            frame_seconds = 0.025f;
        }
        previous_frame_us = now_us;
        const uint32_t now_ms = (uint32_t)(now_us / 1000);
        motion_state_t current_state = motion_state_get(&state_machine);

        /* Plugging in USB on this PCB means the charger started working. */
        const bool charger_attached = charger_is_attached();
        if (charger_attached != previous_charger_attached) {
            previous_charger_attached = charger_attached;
            pet_behavior_post(&pet,
                              charger_attached ? PET_EVENT_CHARGER_ATTACHED
                                               : PET_EVENT_CHARGER_DETACHED,
                              now_ms);
        }

        /* Both I2C devices may be connected after boot; retry without reset. */
        if (!oled_display_is_available() &&
            now_us - last_display_probe_us >= HARDWARE_RETRY_INTERVAL_US) {
            last_display_probe_us = now_us;
            if (oled_display_init() == ESP_OK) {
                ESP_LOGI(TAG, "OLED connected after boot");
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            }
        }

        if (!mpu6050_is_available() &&
            now_us - last_sensor_probe_us >= HARDWARE_RETRY_INTERVAL_US) {
            last_sensor_probe_us = now_us;
            if (mpu6050_init() == ESP_OK) {
                ESP_LOGI(TAG, "Accelerometer connected after boot");
                sensorless_ble_announced = false;
                previous_tilt_zone = 0;
                motion_detector_init(&detector, now_us,
                                     MOTION_MOVEMENT_DELTA_THRESHOLD,
                                     MOTION_SHAKE_DELTA_THRESHOLD,
                                     MOTION_SHAKE_COUNT_REQUIRED,
                                     MOTION_SHAKE_WINDOW_US,
                                     SLEEP_STILLNESS_TIMEOUT_US);
                phone_sync_stop_advertising();
            }
        }

