Godcomplexx/Keychain_motion/xiao_nrf52840/src/main.c
        /* With no accelerometer there is no triple-shake gesture. */
        if (phone_sync_available && !mpu6050_is_available() &&
            now_us - last_sensorless_ble_request_us >=
                SENSORLESS_BLE_RETRY_US) {
            last_sensorless_ble_request_us = now_us;
            if (phone_sync_request_advertising() == ESP_OK &&
                !sensorless_ble_announced) {
                /*
                 * Advertising is retried every few seconds here, so the pet is
                 * told only once: otherwise it would restart the looking-for-
                 * the-phone animation forever and never show anything else.
                 */
                sensorless_ble_announced = true;
                pet_behavior_post(&pet, PET_EVENT_PHONE_WINDOW_OPEN, now_ms);
            }
        }

        if (phone_sync_window_active &&
            now_us >= phone_sync_window_deadline_us) {
            phone_sync_stop_advertising();
            phone_sync_window_active = false;
            pet_behavior_post(&pet, PET_EVENT_PHONE_WINDOW_CLOSED, now_ms);
            ESP_LOGI(TAG, "Phone sync window expired");
        }

        phone_sync_command_t command;
        if (phone_sync_available && phone_sync_get_command(&command) &&
            command == PHONE_SYNC_COMMAND_START_GAME) {
            phone_sync_window_active = false;
            phone_sync_stop_advertising();
            k_sleep(K_MSEC(PHONE_SYNC_SHUTDOWN_GRACE_MS));
            (void)phone_sync_shutdown();

            const motion_state_t previous_state = current_state;
            current_state = motion_state_handle_event(
                &state_machine, MOTION_EVENT_GAME_REQUESTED, true, now_us);
            breakout_game_start(&game, now_us, sys_rand32_get(), last_tilt_x);
            if (current_state != previous_state) {
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            }
            ESP_LOGW(TAG, "Breakout started from phone command");
        }

        device_clock_datetime_t phone_datetime;
        if (phone_sync_available &&
            phone_sync_get_datetime_update(&phone_datetime)) {
            device_clock_set_datetime(&clock, &phone_datetime, now_us);
            if (step_counter_get_date_key(&steps) !=
                device_clock_date_key(&phone_datetime)) {
                step_counter_init(&steps,
                                  device_clock_date_key(&phone_datetime));
            }
            phone_sync_window_active = false;
            phone_sync_stop_advertising();
            k_sleep(K_MSEC(PHONE_SYNC_SHUTDOWN_GRACE_MS));
            (void)phone_sync_shutdown();

            const motion_state_t previous_state = current_state;
            current_state = motion_state_handle_event(
                &state_machine, MOTION_EVENT_TIME_REQUESTED, true, now_us);
            if (current_state != previous_state) {
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            } else if (current_state == MOTION_STATE_TIME) {
                previous_time_frame_us = 0;
            }
            pet_behavior_post(&pet, PET_EVENT_PHONE_SYNCED, now_ms);
            ESP_LOGW(TAG, "Clock synchronized from phone");
        }

        if (current_state == MOTION_STATE_TIME &&
            now_us - motion_state_entered_at_us(&state_machine) >=
                TIME_STATE_DURATION_US) {
            const bool movement_recent = !mpu6050_is_available() ||
                motion_detector_has_recent_movement(&detector, now_us);
            (void)motion_state_handle_event(&state_machine,
                                            MOTION_EVENT_TIME_TIMEOUT,
                                            movement_recent, now_us);
            current_state = motion_state_get(&state_machine);
            apply_state_entry_actions(current_state, now_us,
                                      &previous_frame_us,
                                      &previous_sleep_frame_us,
                                      &previous_time_frame_us);
        }

        mpu6050_accel_data_t raw_data = {0, 0, 256};
        motion_detector_result_t detector_result = {0};
        motion_event_t event = MOTION_EVENT_NONE;
        bool sensor_sample_valid = false;
        if (mpu6050_is_available()) {
            if (mpu6050_read_accel(&raw_data) == ESP_OK) {
                sensor_sample_valid = true;
                device_clock_get_datetime(&clock, now_us, &datetime);
                step_counter_update(&steps, &raw_data,
                                    device_clock_date_key(&datetime), now_us);
                detector_result = motion_detector_update(
                    &detector, &raw_data, now_us);
                event = detector_result_to_event(&detector_result);
            } else {
                ESP_LOGW(TAG, "Accelerometer disconnected; continuing safely");
                last_sensor_probe_us = now_us;
                if (current_state == MOTION_STATE_SLEEP) {
                    current_state = motion_state_handle_event(
                        &state_machine, MOTION_EVENT_MOVEMENT_DETECTED,
                        true, now_us);
                    apply_state_entry_actions(current_state, now_us,
                                              &previous_frame_us,
                                              &previous_sleep_frame_us,
                                              &previous_time_frame_us);
                }
            }
        }

        if (sensor_sample_valid && event == MOTION_EVENT_SHAKE_DETECTED) {
            /* The pet reacts to being shaken whatever the screen is doing. */
            pet_behavior_post(&pet, PET_EVENT_SHAKEN, now_ms);
            if (current_state == MOTION_STATE_GAME) {
                current_state = motion_state_handle_event(
                    &state_machine, MOTION_EVENT_GAME_FINISHED, true, now_us);
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            }
            if (!phone_sync_window_active && phone_sync_available &&
                phone_sync_request_advertising() == ESP_OK) {
                phone_sync_window_active = true;
                phone_sync_window_deadline_us = now_us + PHONE_SYNC_WINDOW_US;
                pet_behavior_post(&pet, PET_EVENT_PHONE_WINDOW_OPEN, now_ms);
                ESP_LOGW(TAG, "Triple shake: BLE window open for 60 seconds");
            }
        } else if (sensor_sample_valid && event != MOTION_EVENT_NONE) {
            /*
             * Movement that ends a SLEEP means the keychain was picked up; the
             * same event during normal use only keeps the idle timers reset.
             */
            if (event == MOTION_EVENT_MOVEMENT_DETECTED) {
                pet_behavior_post(&pet,
                                  (current_state == MOTION_STATE_SLEEP)
                                      ? PET_EVENT_PICKED_UP
                                      : PET_EVENT_MOVEMENT,
                                  now_ms);
            }
            const motion_state_t previous_state = current_state;
            current_state = motion_state_handle_event(
                &state_machine, event,
                motion_detector_has_recent_movement(&detector, now_us), now_us);
            if (current_state != previous_state) {
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            }
        }

        float tilt_x;
        float tilt_y;
        if (sensor_sample_valid) {
            tilt_x = mpu6050_accel_to_g(raw_data.x);
            tilt_y = mpu6050_accel_to_g(raw_data.y);
        } else {
            /* A triangle wave keeps FLUID and GAME visibly testable. */
            demo_tilt += (float)demo_direction * 0.02f;
            if (demo_tilt >= 0.7f || demo_tilt <= -0.7f) {
                demo_direction = -demo_direction;
            }
            tilt_x = demo_tilt;
            tilt_y = 0.35f;
        }
        last_tilt_x = tilt_x;

